Repository: leofilllium/Taxi-Application
Catalog: lib/l10n/app_*.arb
Languages: fa

# appName
source: Safar One
fa: سفر

source: Welcome Back
fa: خوش آمدید

source: Create Account
fa: ایجاد حساب کاربری

source: Sign in to continue
fa: برای ادامه وارد شوید

source: Let's get you started
fa: بیایید شروع کنیم

# emailLabel
source: Email
fa: ایمیل

# passwordLabel
source: Password
fa: رمز عبور

# fullNameLabel
source: Full Name
fa: نام کامل

# phoneLabel
source: Phone Number
fa: شماره تلفن

source: I am a...
fa: من یک ... هستم

# userTypeClient
source: Client
fa: مشتری

# userTypeDriver
source: Driver
fa: راننده

# vehicleDetailsTitle
source: Vehicle Details
fa: مشخصات وسیله نقلیه

# vehicleModelLabel
source: Vehicle Model
fa: مدل وسیله نقلیه

# licensePlateLabel
source: License Plate
fa: پلاک

# colorLabel
source: Color
fa: رنگ

# yearLabel
source: Year
fa: سال

# vehicleTypeLabel
source: Vehicle Type
fa: نوع وسیله نقلیه

# vehicleTypeSedan
source: Sedan
fa: سدان

# vehicleTypeSuv
source: SUV
fa: شاسی بلند

# vehicleTypeHatchback
source: Hatchback
fa: هاچ‌بک

# vehicleTypeMinivan
source: Minivan
fa: مینی‌ون

# vehicleTypeTukTuk
source: Tuk-tuk
fa: توک-توک

# vehicleTypeMotorbike
source: Motorbike
fa: موتورسیکلت

# signInButton
source: Sign In
fa: ورود

# createAccountButton
source: Create Account
fa: ایجاد حساب

# alreadyHaveAccount
source: Already have an account? Sign in
fa: حساب کاربری دارید؟ وارد شوید

# dontHaveAccount
source: Create an account
fa: ایجاد حساب کاربری

# emailValidationError
source: Enter email
fa: ایمیل را وارد کنید

# passwordValidationError
source: Password must be at least 6 characters
fa: رمز عبور باید حداقل ۶ کاراکتر باشد

# nameValidationError
source: Enter name
fa: نام را وارد کنید

# phoneValidationError
source: Enter phone
fa: شماره تلفن را وارد کنید

source: Where to?
fa: کجا می‌روید؟

source: Ride
fa: سفر

source: Delivery
fa: تحویل

source: Cancel
fa: لغو

source: Driver responding...
fa: در حال پاسخگویی راننده...

# searchingWaitMessage
source: This usually takes a few seconds
fa: این معمولاً چند ثانیه طول می‌کشد

# arrivingIn
source: Arriving in ~{minutes} min
fa: رسیدن در حدود {minutes} دقیقه

# freeWaitTime
source: Free wait time: {time}
fa: زمان انتظار رایگان: {time}

# meetDriverAtPickup
source: Meet driver at the pickup point
fa: راننده را در محل سوار شدن ملاقات کنید

# minutesLeft
source: {minutes} min left
fa: {minutes} دقیقه باقی مانده

source: On the way to destination
fa: در راه به مقصد

source: On my way
fa: در راهم

source: Safety
fa: ایمنی

source: Contact
fa: تماس

source: Location Access Required
fa: دسترسی به موقعیت مکانی لازم است

# locationAccessMessage
source: We need access to your location to find rides and show your position on the map.
fa: برای یافتن سفر و نمایش موقعیت شما روی نقشه، به دسترسی به موقعیت مکانی شما نیاز داریم.

source: Enable Location
fa: فعال کردن موقعیت مکانی

# requestRide
source: Request {rideName}
fa: درخواست {rideName}

# requestDelivery
source: Request Delivery ({price})
fa: درخواست تحویل ({price})

source: Choose destination
fa: انتخاب مقصد

source: Search
fa: جستجو

source: Select on Map
fa: انتخاب روی نقشه

source: Current Location
fa: موقعیت فعلی

source: Pickup Location
fa: محل سوار شدن

source: Confirm Destination
fa: تایید مقصد

# routeInfo
source: {distance} km · {duration} min
fa: {distance} کیلومتر · {duration} دقیقه

source: Delivery Details
fa: جزئیات تحویل

# recipientName
source: Recipient's Name
fa: نام گیرنده

# recipientPhone
source: Recipient's Phone
fa: تلفن گیرنده

# packageDetails
source: Package details (e.g., documents)
fa: جزئیات بسته (مثلا اسناد)

source: Fragile Package?
fa: بسته شکستنی است؟

# youAreOnline
source: You're online
fa: شما آنلاین هستید

# youAreOffline
source: You're offline
fa: شما آفلاین هستید

source: Heading to pickup
fa: در راه به مبدا

source: Heading to pickup package
fa: در راه برای گرفتن بسته

source: Arrived at pickup
fa: به مبدا رسید

source: Arrived for package pickup
fa: برای گرفتن بسته رسید

source: On trip
fa: در سفر

source: Delivering package
fa: در حال تحویل بسته

source: On a ride
fa: در حال سفر

source: Trip Request
fa: درخواست سفر

source: Delivery Request
fa: درخواست تحویل

source: PICKUP
fa: مبدا

source: DROPOFF
fa: مقصد

source: PACKAGE
fa: بسته

source: RECIPIENT
fa: گیرنده

source: Decline
fa: رد کردن

source: Accept
fa: پذیرفتن

source: Go Online
fa: آنلاین شوید

source: Go Offline
fa: آفلاین شوید

source: Confirm Package Pickup
fa: تایید گرفتن بسته

source: Arrived for Pickup
fa: به مبدا رسیدم

source: Start Delivery
fa: شروع تحویل

source: Start Ride
fa: شروع سفر

source: Confirm Drop-off
fa: تایید تحویل

source: Complete Ride
fa: پایان سفر

source: Cancel Ride
fa: لغو سفر

source: Passenger Info
fa: اطلاعات مسافر

source: Recipient Info
fa: اطلاعات گیرنده

source: Sender Info
fa: اطلاعات فرستنده

source: Ride History
fa: تاریخچه سفرها

source: No Past Rides
fa: سفر گذشته‌ای وجود ندارد

# pastRidesMessage
source: Your completed rides will appear here.
fa: سفرهای تکمیل شده شما در اینجا نمایش داده می‌شود.

# from
source: From: {address}
fa: از: {address}

# statusSearching
source: Searching for driver
fa: در جستجوی راننده

# statusDriverOnWay
source: Driver on the way
fa: راننده در راه است

# statusDriverArrived
source: Driver has arrived
fa: راننده رسیده است

# statusInProgress
source: On the way to destination
fa: در راه به مقصد

# statusCompleted
source: Completed
fa: تکمیل شده

# statusCancelled
source: Cancelled
fa: لغو شده

source: Select Language
fa: زبان را انتخاب کنید

# continueButton
source: Continue
fa: ادامه

source: Rate your ride
fa: سفر خود را ارزیابی کنید

# howWasYourTripWith
source: How was your trip with {driverName}?
fa: سفر شما با {driverName} چگونه بود؟

source: Add a comment...
fa: نظر خود را اضافه کنید...

source: Submit Rating
fa: ثبت ارزیابی

source: Skip
fa: رد کردن

source: Profile Picture
fa: تصویر پروفایل

source: Choose your ride
fa: سفر خود را انتخاب کنید

source: Available nearby
fa: در این نزدیکی موجود است

source: Delivery Service
fa: خدمات تحویل

source: Motorbike delivery
fa: تحویل با موتورسیکلت

# deliveryDetailsTitle
source: Delivery Details
fa: جزئیات تحویل

# recipientNameLabel
source: Recipient Name
fa: نام گیرنده

# recipientNamePlaceholder
source: Enter recipient's full name
fa: نام کامل گیرنده را وارد کنید

# recipientNameError
source: Name is required
fa: نام الزامی است

# recipientPhoneLabel
source: Phone Number
fa: شماره تلفن

# recipientPhonePlaceholder
source: Enter recipient's phone number
fa: شماره تلفن گیرنده را وارد کنید

# recipientPhoneError
source: Phone number is required
fa: شماره تلفن الزامی است

# packageDescriptionLabel
source: Package Description
fa: توضیحات بسته

# packageDescriptionPlaceholder
source: Describe what you're sending
fa: توضیح دهید چه چیزی ارسال می‌کنید

# packageDescriptionError
source: Package description is required
fa: توضیحات بسته الزامی است

# fragilePackageLabel
source: Fragile Package
fa: بسته شکستنی

# handleWithCare
source: Handle with extra care
fa: با احتیاط حمل شود

# requestDeliveryButton
source: Request Delivery • {price}
fa: درخواست تحویل • {price}

# settingUpDriver
source: Setting up your driver profile...
fa: تنظیم پروفایل راننده تان...

# weNeedLocationMatch
source: We need your location to match you with riders.
fa: ما به موقعیت شما نیاز داریم تا شما را با سوارکاران مطابقت دهد.

# locationDetails
source: Getting location details...
fa: دریافت جزئیات موقعیت...

source: Trip Completed!
fa: سفر تکمیل شد!

source: Final Price
fa: قیمت نهایی

source: Close
fa: بستن

# navigateTo
source: Navigate to {targetName}
fa: رفتن به {targetName}

# chooseNavigationApp
source: Choose your navigation app
fa: اپلیکیشن مسیریابی خود را انتخاب کنید

source: Google Maps
fa: نقشه گوگل

source: Apple Maps
fa: نقشه اپل

source: Yandex Maps
fa: نقشه یاندکس

# errorOpeningNavigation
source: Error opening navigation: {error}
fa: خطا در باز کردن مسیریاب: {error}

# couldNotOpenGoogleMaps
source: Could not open Google Maps: {error}
fa: امکان باز کردن نقشه گوگل وجود ندارد: {error}

source: Apple Maps not available
fa: نقشه اپل در دسترس نیست

# couldNotOpenAppleMaps
source: Could not open Apple Maps: {error}
fa: امکان باز کردن نقشه اپل وجود ندارد: {error}

source: Searching locations...
fa: جستجوی مکان ها...

# moveMapToSelectLocation
source: Move the map to select a location
fa: نقشه را حرکت دهید تا مکان را انتخاب کنید

source: Destination
fa: مقصد

source: Profile
fa: پروفایل

source: Edit Profile
fa: ویرایش پروفایل

source: Save Changes
fa: ذخیره تغییرات

source: Logout
fa: خروج

source: Delete Account
fa: حذف حساب کاربری

# deleteAccountConfirmationTitle
source: Delete Account?
fa: حذف حساب کاربری؟

# deleteAccountConfirmationMessage
source: Are you sure you want to permanently delete your account? This action cannot be undone.
fa: آیا مطمئن هستید که می‌خواهید حساب کاربری خود را برای همیشه حذف کنید؟ این عمل قابل بازگشت نیست.

# actionDelete
source: Delete
fa: حذف

# profileUpdateSuccess
source: Profile updated successfully!
fa: پروفایل با موفقیت به‌روزرسانی شد!

# profileUpdateFailed
source: Failed to update profile
fa: به‌روزرسانی پروفایل ناموفق بود

# accountDeletionSuccess
source: Account deleted successfully.
fa: حساب کاربری با موفقیت حذف شد.

# accountDeletionFailed
source: Failed to delete account.
fa: حذف حساب کاربری ناموفق بود.

source: Where would you like to go?
fa: شما میخواهید کجا بروید؟

# searchForDestination
source: Search for a destination
fa: جستجوی مقصد

source: Personal Information
fa: معلومات شخصی

source: Tap to change photo
fa: برای تغییر عکس ضربه بزنید

source: Location Services Disabled
fa: خدمات موقعیت غیرفعال شده است

# pleaseEnableLocation
source: Please enable location services to receive ride requests.
fa: لطفاً خدمات موقعیت را برای دریافت درخواست های سواری فعال کنید.

source: Settings
fa: تنظیمات

source: Location Permission
fa: اجازه موقعیت

# thisAppNeedsLocation
source: This app needs location permission to function. Please grant permission in settings.
fa: این اپلیکیشن برای فعالیت نیاز به اجازه موقعیت دارد. لطفاً در تنظیمات اجازه بدهید.

# byCreatingAccountYouAgree
source: By creating an account, you agree to our
fa: با ایجاد یک حساب کاربری ، شما با ما موافقت می کنید

source: Privacy Policy
fa: سیاست حفظ حریم خصوصی

# legal
source: Legal information
fa: اطلاعات حقوقی

# privacyPolicyDescription
source: Review the terms of data processing
fa: بررسی شرایط پردازش داده ها

# locationAccessTitle
source: Location Access
fa: دسترسی به مکان

# locationAccessMessageClient
source: Safar One collects location data to find nearby drivers for you, set routes, and track your trip. This is necessary for the service to work.
fa: Safar One داده های مکان را جمع آوری می کند تا رانندگان نزدیک را برای شما پیدا کند ، مسیرها را تعیین کند و سفر شما را ردیابی کند. این برای کار سرویس ضروری است.

# locationAccessMessageDriver
source: Safar One collects location data to offer you orders nearby, set routes, and show your location to the customer. It is necessary for work.
fa: Safar One داده های مکان را جمع آوری می کند تا سفارشات نزدیک را به شما ارائه دهد ، مسیرها را تنظیم کند و مکان خود را به مشتری نشان دهد. برای کار ضروری است.

# locationDataUsage
source: How we use your location:
fa: چگونه از موقعیت مکانی شما استفاده می‌کنیم:

# locationUsageMatching
source: Match you with nearby drivers
fa: شما را با رانندگان نزدیک مطابقت دهیم

# locationUsageTracking
source: Track your ride in real-time
fa: سفر شما را به صورت زنده ردیابی کنیم

# locationUsageSharing
source: Share your location with your driver
fa: موقعیت شما را با راننده به اشتراک بگذاریم

# locationUsageRouting
source: Calculate optimal routes
fa: مسیرهای بهینه را محاسبه کنیم

# privacyPolicyPrefix
source: Read our
fa: بخوانید
